function [I] = imgCut(I, edge)
% 图像裁切预处理，去除相机边缘极大像素值
% ---------------------------INFO---------------------------------
%                       _      ____ __
%                      | | /| / / // /
%                      | |/ |/ / _  / 
%                      |__/|__/_//_/  
% 
%  Version: 1.0 | Date: 2024-08-31
%  Author: https://github.com/Wonham | wanghan201@mails.ucas.ac.cn
% ----------------------------------------------------------------
I(1:edge, :) = [];
I(end-edge+1:end, :) = [];
I(:, 1:edge) = [];
I(:, end-edge+1:end) = [];
end